Unit/src/Catalogs/Unit_MockServiceData/Unit_MockServiceData.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Unit_MockServiceData</name>
  <basedOn>Catalog.Unit_ServiceExchangeHistory</basedOn>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Request_Type</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Request_ResourceAddress</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Request_Body</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Request_BodyMD5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Request_BodyAsFilter</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Request_BodySize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Request_BodyType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Request_BodyIsText</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Answer_Message</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Answer_StatusCode</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Answer_Body</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Answer_BodySize</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Answer_BodyType</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Answer_BodyIsText</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Request_Headers</name>
    <attributes>
      <name>VariableName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ValueAsFilter</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Request_Variables</name>
    <attributes>
      <name>VariableName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ValueAsFilter</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Request_AddressParts</name>
    <attributes>
      <name>VariableName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PartNumber</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Request_BodyVariables</name>
    <attributes>
      <name>VariableName</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>PathToValue</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ValueAsFilter</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Answer_Headers</name>
    <attributes>
      <name>Key</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Value</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Unit/src/Catalogs/Unit_MockServiceData/ObjectModule.bsl
// @strict-types

#Region EventHandlers

Procedure Filling(FillingData, StandartProcessing) 

	If TypeOf(FillingData) = Type("CatalogRef.Unit_ServiceExchangeHistory") Then
		
		InputRequest = FillingData;
		InputAnswer = FillingData;
		If InputAnswer.Parent.IsEmpty() Then
			InputAnswer = IntegrationServer.Unit_GetLastAnswerByRequest(InputAnswer);
		Else
			InputRequest = InputAnswer.Parent;
		EndIf;
		
		Description = InputRequest.Description;
		
		Request_Type = InputRequest.RequestType;
		Request_Body = InputRequest.Body;
		Request_BodyMD5 = InputRequest.BodyMD5;
		Request_BodySize = InputRequest.BodySize;
		Request_BodyType = InputRequest.BodyType;
		Request_BodyIsText = InputRequest.BodyIsText;
		
		ArrayOfSegments = StrSplit(InputRequest.ResourceAddress, "?");
		Request_ResourceAddress = ArrayOfSegments[0];

		HeadersValue = InputRequest.Headers.Get();
		If TypeOf(HeadersValue) = Type("Map") Then
			For Each KeyValue In HeadersValue Do
				RequestHeaderRow       = Request_Headers.Add();
				RequestHeaderRow.Key   = String(KeyValue.Key);
				RequestHeaderRow.Value = String(KeyValue.Value);
			EndDo;
		EndIf;
		
		Answer_Message = InputAnswer.ResourceAddress;
		Answer_StatusCode = InputAnswer.StatusCode;
		Answer_Body = InputAnswer.Body;
		Answer_BodySize = InputAnswer.BodySize;
		Answer_BodyType = InputAnswer.BodyType;
		Answer_BodyIsText = InputAnswer.BodyIsText;

		HeadersValue = InputAnswer.Headers.Get();
		If TypeOf(HeadersValue) = Type("Map") Then
			For Each KeyValue In HeadersValue Do
				AnswerHeaderRow       = Answer_Headers.Add();
				AnswerHeaderRow.Key   = String(KeyValue.Key);
				AnswerHeaderRow.Value = String(KeyValue.Value);
			EndDo;
		EndIf;
		
	EndIf;

EndProcedure

#EndRegion
